Autodesk.Revit.DB.ModelPath.SetVersionUrn(System.String)
An URN identifying the Forge DM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/) model version.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPath.SetFolderId(System.String)
An URN identifying the Forge DM (Data Management, see https://developer.autodesk.com/en/docs/data/v2/overview/) model folder.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPath.GetPath
Since:
2012

Autodesk.Revit.DB.ModelPath.GetProjectGUID
A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated.
Since:
2012

Autodesk.Revit.DB.ModelPath.Compare(Autodesk.Revit.DB.ModelPath)
Compares this ModelPath with another
Remarks:
The comparison is case-insensitive.
otherPath:
The path to compare against.
Returns:
A signed integer indicating the lexical relationship between
two ModelPaths. Value is less than zero if this path is less than
the given path; zero if the two are the same; and more than zero otherwise
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.ModelPath.Region
The region of the BIM 360 Docs or Autodesk Docs account and project which contains this model.
Since:
2021

Autodesk.Revit.DB.ModelPath.CentralServerPath
The path to the location of the central Revit server or cloud.
Since:
2012